Transforming Data(Feature Enginnering)

In [1]:
import pandas as pd 

df=pd.read_csv("../08Pandas/raw_data.csv")

df2=df.copy()

# apply tax fun on income - applyfuns take funs
df2["tax"]=df2["income"].apply(lambda x:"20%" if x>=50000 else "10%")
df2

    id          name   age country   gender   income  tax
0    1      John Doe  29.0     USA     Male  55000.0  20%
1    1      John Doe  29.0     USA     Male  55000.0  20%
2    2    Jane Smith   NaN  Canada   Female  62000.0  20%
3    3          Alex   NaN     USA  Unknown  47000.0  10%
4    4  Maria Garcia  34.0   Spain   Female      NaN  10%
5    5        Li Wei  27.0   China     Male  51000.0  20%
6    6           NaN  45.0   India   Female  73000.0  20%
7    7    Ahmed Khan  38.0     NaN     Male  68000.0  20%
8    8    Rachel Lee  29.0     USA   Female  62000.0  20%
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0  10%
10  10   Emily Davis  31.0     USA      NaN  58000.0  20%

In [2]:
#Map fun

gender_map = {"Male": "M", "Female": "F", "Unknown": "U"}

# Correct way â€” modify only the 'gender' column
df2["gender"] = df2["gender"].map(gender_map)

# Display the full DataFrame
df2

    id          name   age country gender   income  tax
0    1      John Doe  29.0     USA      M  55000.0  20%
1    1      John Doe  29.0     USA      M  55000.0  20%
2    2    Jane Smith   NaN  Canada      F  62000.0  20%
3    3          Alex   NaN     USA      U  47000.0  10%
4    4  Maria Garcia  34.0   Spain      F      NaN  10%
5    5        Li Wei  27.0   China      M  51000.0  20%
6    6           NaN  45.0   India      F  73000.0  20%
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%
8    8    Rachel Lee  29.0     USA      F  62000.0  20%
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%
10  10   Emily Davis  31.0     USA    NaN  58000.0  20%

In [3]:
#Assing- we can create new col with assign fun

df2.assign(new_income=df2["income"]*1.1)
df2

    id          name   age country gender   income  tax
0    1      John Doe  29.0     USA      M  55000.0  20%
1    1      John Doe  29.0     USA      M  55000.0  20%
2    2    Jane Smith   NaN  Canada      F  62000.0  20%
3    3          Alex   NaN     USA      U  47000.0  10%
4    4  Maria Garcia  34.0   Spain      F      NaN  10%
5    5        Li Wei  27.0   China      M  51000.0  20%
6    6           NaN  45.0   India      F  73000.0  20%
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%
8    8    Rachel Lee  29.0     USA      F  62000.0  20%
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%
10  10   Emily Davis  31.0     USA    NaN  58000.0  20%

In [4]:
# replace old values

df2["country"]=df2["country"].replace("USA","US")
df2

    id          name   age country gender   income  tax
0    1      John Doe  29.0      US      M  55000.0  20%
1    1      John Doe  29.0      US      M  55000.0  20%
2    2    Jane Smith   NaN  Canada      F  62000.0  20%
3    3          Alex   NaN      US      U  47000.0  10%
4    4  Maria Garcia  34.0   Spain      F      NaN  10%
5    5        Li Wei  27.0   China      M  51000.0  20%
6    6           NaN  45.0   India      F  73000.0  20%
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%
8    8    Rachel Lee  29.0      US      F  62000.0  20%
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%
10  10   Emily Davis  31.0      US    NaN  58000.0  20%

In [ ]:
# Rname- rows or colmns

df2.columns=["ID","NAME","AGE","COUNTRY","GENDER","INCOME","TAX"]

# rename
df2.rename(columns={"INCOME": "Salary"})
df2

# rename row
df2.rename(index={1:"First"})

       ID          NAME   AGE COUNTRY GENDER   Salary  TAX
0       1      John Doe  29.0      US      M  55000.0  20%
First   1      John Doe  29.0      US      M  55000.0  20%
2       2    Jane Smith   NaN  Canada      F  62000.0  20%
3       3          Alex   NaN      US      U  47000.0  10%
4       4  Maria Garcia  34.0   Spain      F      NaN  10%
5       5        Li Wei  27.0   China      M  51000.0  20%
6       6           NaN  45.0   India      F  73000.0  20%
7       7    Ahmed Khan  38.0     NaN      M  68000.0  20%
8       8    Rachel Lee  29.0      US      F  62000.0  20%
9       9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%
10     10   Emily Davis  31.0      US    NaN  58000.0  20%

In [ ]:
# Sorting
df2=df2.fillna(50)
df2.sort_values("Salary")
sorted_df=df2.sort_values(["Salary","AGE"], ascending=False)# if salary is same then sorting will be based on age

# sort the index
sorted_df.sort_index()

# reset index - but keep the data as it is- crete new index col
sorted_df.reset_index()
# drop old index- do not preserve old index
sorted_df.reset_index(drop=True)

    ID          NAME   AGE COUNTRY GENDER   Salary  TAX
0    6            50  45.0   India      F  73000.0  20%
1    7    Ahmed Khan  38.0      50      M  68000.0  20%
2    2    Jane Smith  50.0  Canada      F  62000.0  20%
3    8    Rachel Lee  29.0      US      F  62000.0  20%
4   10   Emily Davis  31.0      US     50  58000.0  20%
5    1      John Doe  29.0      US      M  55000.0  20%
6    1      John Doe  29.0      US      M  55000.0  20%
7    5        Li Wei  27.0   China      M  51000.0  20%
8    3          Alex  50.0      US      U  47000.0  10%
9    9   Carlos Ruiz  50.0  Mexico      M  45000.0  10%
10   4  Maria Garcia  34.0   Spain      F     50.0  10%

In [34]:
# Ranking

sorted_df["Ranking"]=sorted_df["Salary"].rank(ascending=False,method='dense')#dense  to resolve tie- do not assignt avg
sorted_df["Ranking"]=sorted_df["Salary"].rank(ascending=False,method='max')#max  assign max value to same salary 
sorted_df

    ID          NAME   AGE COUNTRY GENDER   Salary  TAX  Ranking
6    6            50  45.0   India      F  73000.0  20%      1.0
7    7    Ahmed Khan  38.0      50      M  68000.0  20%      2.0
2    2    Jane Smith  50.0  Canada      F  62000.0  20%      4.0
8    8    Rachel Lee  29.0      US      F  62000.0  20%      4.0
10  10   Emily Davis  31.0      US     50  58000.0  20%      5.0
0    1      John Doe  29.0      US      M  55000.0  20%      7.0
1    1      John Doe  29.0      US      M  55000.0  20%      7.0
5    5        Li Wei  27.0   China      M  51000.0  20%      8.0
3    3          Alex  50.0      US      U  47000.0  10%      9.0
9    9   Carlos Ruiz  50.0  Mexico      M  45000.0  10%     10.0
4    4  Maria Garcia  34.0   Spain      F     50.0  10%     11.0

In [37]:
# Reassign colmns

sorted_df[["ID","AGE","COUNTRY","GENDER","Salary","TAX","NAME","Ranking"]
]
sorted_df

    ID          NAME   AGE COUNTRY GENDER   Salary  TAX  Ranking
6    6            50  45.0   India      F  73000.0  20%      1.0
7    7    Ahmed Khan  38.0      50      M  68000.0  20%      2.0
2    2    Jane Smith  50.0  Canada      F  62000.0  20%      4.0
8    8    Rachel Lee  29.0      US      F  62000.0  20%      4.0
10  10   Emily Davis  31.0      US     50  58000.0  20%      5.0
0    1      John Doe  29.0      US      M  55000.0  20%      7.0
1    1      John Doe  29.0      US      M  55000.0  20%      7.0
5    5        Li Wei  27.0   China      M  51000.0  20%      8.0
3    3          Alex  50.0      US      U  47000.0  10%      9.0
9    9   Carlos Ruiz  50.0  Mexico      M  45000.0  10%     10.0
4    4  Maria Garcia  34.0   Spain      F     50.0  10%     11.0

In [43]:
# Shift id columns at last

df3=df.copy()
new_col=[col for col in df3.columns if col!="ID"]+["ID"]
df3=df3[new_col]
df3

            NAME   AGE COUNTRY GENDER   Salary  TAX  ID
0       John Doe  29.0      US      M  55000.0  20%   1
1       John Doe  29.0      US      M  55000.0  20%   1
2     Jane Smith  50.0  Canada      F  62000.0  20%   2
3           Alex  50.0      US      U  47000.0  10%   3
4   Maria Garcia  34.0   Spain      F     50.0  10%   4
5         Li Wei  27.0   China      M  51000.0  20%   5
6             50  45.0   India      F  73000.0  20%   6
7     Ahmed Khan  38.0      50      M  68000.0  20%   7
8     Rachel Lee  29.0      US      F  62000.0  20%   8
9    Carlos Ruiz  50.0  Mexico      M  45000.0  10%   9
10   Emily Davis  31.0      US     50  58000.0  20%  10

Write data to csv

In [ ]:
new_data=pd.read_csv("../08Pandas/raw_data.csv")
new_data=new_data.drop_duplicates()
new_data["gender"]=new_data["gender"].fillna("Male")
new_data=new_data.fillna(0)
new_data=new_data.sort_values("income")
new_data=new_data.reset_index(drop=True) # reset the index and drop old index
new_data

   id          name   age country   gender   income
0   4  Maria Garcia  34.0   Spain   Female      0.0
1   9   Carlos Ruiz   0.0  Mexico     Male  45000.0
2   3          Alex   0.0     USA  Unknown  47000.0
3   5        Li Wei  27.0   China     Male  51000.0
4   1      John Doe  29.0     USA     Male  55000.0
5  10   Emily Davis  31.0     USA     Male  58000.0
6   2    Jane Smith   0.0  Canada   Female  62000.0
7   8    Rachel Lee  29.0     USA   Female  62000.0
8   7    Ahmed Khan  38.0       0     Male  68000.0
9   6             0  45.0   India   Female  73000.0